{
  "locaciones": [
    {
      "nombre": "Ciudad de Bolívar",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 630,
        "y": 100
      },
      "mapa": 1
    },
    {
      "nombre": "Hospital de la Misericordia",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 300,
        "y": 400
      },
      "mapa": 1
    },
    {
      "nombre": "Cementerio",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 500,
        "y": 100
      },
      "mapa": 1
    },
    {
      "nombre": "PLAZA DE LA ADUANA",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 1680,
        "y": 250
      },
      "mapa": 2,
      "contenido": {
        "texto": "Aquí, en la bulliciosa Plaza de la Aduana, un joven llamado Florentino Ariza vio por primera vez a Fermina Daza. Este encuentro, fugaz y aparentemente trivial, se convertiría en el origen de un amor que marcaría sus vidas para siempre. Para Florentino, fue amor a primera vista, un amor que no conocía límites ni razón, y que lo llevó a expresar sus sentimientos en palabras cuidadosamente elegidas.",
        "imagen": "Gabriel2.png",
        "audio": "Plaza aduana.mp3",
        "carta": {
          "texto": "Señorita Fermina Daza, desde el día en que la vi, mi corazón no ha conocido descanso. Cada latido es un recordatorio de su belleza, y cada suspiro, un anhelo de su presencia. No pido más que una oportunidad para demostrarle la sinceridad de mi afecto, y que mi amor por usted es eterno. Su devoto, Florentino Ariza.",
          "imagen": "Florentino.png",
          "audio": "Carta1.mp3"
        }
      }
    },
    {
      "nombre": "CASA DE FERMINA",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 500,
        "y": 250
      },
      "mapa": 2,
      "contenido": {
        "texto": "Fermina, con la inocencia de la juventud, recibió la carta de Florentino con una mezcla de sorpresa y curiosidad. Aunque sus palabras eran profundas, casi demasiado para su corta edad, algo en su interior se conmovió. Decidió responder, aunque sus propios sentimientos aún eran un misterio para ella.",
        "imagen": "Gabriel2.png",
        "audio": "CasaFermina.mp3",
        "carta": {
          "texto": "Señor Florentino Ariza, agradezco sus palabras amables, aunque me sorprenden. Soy una mujer joven, apenas conocedora del mundo, y sus sentimientos me halagan, pero también me desconciertan. Le ruego paciencia, pues mi corazón aún no sabe lo que quiere. Fermina Daza.",
          "imagen": "Fermina.png",
          "audio": "Carta2.mp3"
        }
      }
    },
    {
      "nombre": "CASA DE FLORENTINO",
      "imagen": "locacion.png",
      "coordenadas": {
        "x": 1910,
        "y": 500
      },
      "mapa": 2,
      "contenido": {
        "texto": "Para Florentino, cada carta de Fermina era un faro en la oscuridad. Aislado en su pequeña habitación, rodeado de libros y recuerdos, escribía cartas interminables que no siempre se atrevía a enviar. Eran cartas llenas de pasión, de deseos no cumplidos, y de una espera que parecía interminable.",
        "imagen": "Gabriel2.png",  
        "audio": "Casaflorentino.mp3",
        "carta": {
          "texto": "Querida Fermina, cada día que pasa sin verte es un tormento que mi alma apenas puede soportar. Me debato entre la desesperación y la esperanza, y en la soledad de mi habitación, sólo tus cartas me mantienen vivo. Si supieras cuánto te amo, no me pedirías paciencia. Tu eterno servidor, Florentino.",
          "imagen": "Florentino2.png", 
          "audio": "Carta3.mp3"
        }
      }
    }
  ]
}
